{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "\u0424\u0443\u0442\u0431\u043e\u043b",
    "1": "\u0413\u0430\u043d\u0434\u0431\u043e\u043b",
    "2": "\u0412\u043e\u0434\u043d\u043e\u0435 \u043f\u043e\u043b\u043e",
    "3": "\u0412\u043e\u043b\u0435\u0439\u0431\u043e\u043b",
    "4": "\u041f\u043b\u0430\u0432\u0430\u043d\u0438\u0435",
    "5": "\u0424\u0438\u0433\u0443\u0440\u043d\u043e\u0435 \u043a\u0430\u0442\u0430\u043d\u0438\u0435",
    "6": "\u0422\u044f\u0436\u0435\u043b\u0430\u044f \u0430\u0442\u043b\u0435\u0442\u0438\u043a\u0430",
    "7": "\u0422\u0435\u043d\u043d\u0438\u0441",
    "8": "\u0425\u043e\u043a\u043a\u0435\u0439",
    "9": "\u0424\u0435\u0445\u0442\u043e\u0432\u0430\u043d\u0438\u0435",
    "10": "\u0410\u043a\u0440\u043e\u0431\u0430\u0442\u0438\u043a\u0430",
    "11": "\u0428\u0430\u0445\u043c\u0430\u0442\u044b",
    "12": "\u041a\u043e\u043d\u043d\u044b\u0439 \u0441\u043f\u043e\u0440\u0442"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "label2id": {
    "\u0410\u043a\u0440\u043e\u0431\u0430\u0442\u0438\u043a\u0430": 10,
    "\u0412\u043e\u0434\u043d\u043e\u0435 \u043f\u043e\u043b\u043e": 2,
    "\u0412\u043e\u043b\u0435\u0439\u0431\u043e\u043b": 3,
    "\u0413\u0430\u043d\u0434\u0431\u043e\u043b": 1,
    "\u041a\u043e\u043d\u043d\u044b\u0439 \u0441\u043f\u043e\u0440\u0442": 12,
    "\u041f\u043b\u0430\u0432\u0430\u043d\u0438\u0435": 4,
    "\u0422\u0435\u043d\u043d\u0438\u0441": 7,
    "\u0422\u044f\u0436\u0435\u043b\u0430\u044f \u0430\u0442\u043b\u0435\u0442\u0438\u043a\u0430": 6,
    "\u0424\u0435\u0445\u0442\u043e\u0432\u0430\u043d\u0438\u0435": 9,
    "\u0424\u0438\u0433\u0443\u0440\u043d\u043e\u0435 \u043a\u0430\u0442\u0430\u043d\u0438\u0435": 5,
    "\u0424\u0443\u0442\u0431\u043e\u043b": 0,
    "\u0425\u043e\u043a\u043a\u0435\u0439": 8,
    "\u0428\u0430\u0445\u043c\u0430\u0442\u044b": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 83828
}
